CSV
Excel
HTML
SQL

In [1]:
import pandas as pd

In [2]:
pwd

'C:\\Users\\pnair\\Desktop\\Python\\Python for Financial Analysis and Algo Trading\\Python-for-Finance-Repo-master\\03- General Pandas\\2.0 My_Pandas_Code'

In [4]:
pd.read_csv('example') #can read the csv file as a dataframe

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [7]:
df = pd.read_csv('example') #creates a df object

In [8]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [11]:
df.to_csv('My_Output', index = False) #index does not get saved as a column but stays as the index when index = False

In [10]:
pd.read_csv('My_Output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [12]:
#pandas sees excel workbooks as a bunch of sheets (tabs) where each sheet is a dataframe

In [14]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [16]:
df.to_excel('Dataframe.xlsx',sheet_name='Test') #writes the dataframe to an excel file

In [17]:
#read html

In [18]:
data = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [22]:
data[0].head() #it creates a list of all the dataframes on that web link. I am now indexing the first dataframe

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 21, 2018"
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","July 26, 2017"
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","December 5, 2017"

In [23]:
#reading html is essentially web scraping with pandas

In [25]:
#pandas can be used to read from and write to SQL but..
#you should really use a specific library depending on the type of SQL you are using, e.g different libraries are used to 
#work with postgreSQL, mySQL, etc. Just google the relevant library.